* DNS - meshh convergence

#+NAME: meshConv
|        dofs |          dwc |        <u_o> |   dwo (visc) |        P srf |      P left |     P right | dwo (press) |          dwo |       P1-P2 |      dwc 1 |     <u_o> 1 |      dwo 1 |    P1-P2 1 |
|-------------+--------------+-------------+--------------+--------------+-------------+-------------+-------------+--------------+-------------+------------+------------+------------+------------|
| 1.035457E06 | -7.65354E-04 | 1.34050E-03 | -9.88107E-06 | -5.24894E-04 | 3.34673E-03 | 2.51511E-03 | 3.06729E-04 | -3.16610E-04 | 1.38132E-01 |         1. |         1. |         1. |         1. |
|  6.46055E05 | -7.64967E-04 | 1.33680E-03 | -9.79347E-06 | -5.23605E-04 | 3.33646E-03 | 2.50689E-03 | 3.05966E-04 | -3.15759E-04 | 1.35974E-01 | 0.99949435 | 0.99723984 | 0.99731215 | 0.98437726 |
|  3.73004E05 | -7.64508E-04 | 1.33548E-03 | -9.79383E-06 | -5.23360E-04 | 3.33465E-03 | 2.50596E-03 | 3.05337E-04 | -3.15131E-04 | 1.32764E-01 | 0.99889463 | 0.99625513 | 0.99532864 | 0.96113862 |
|  2.01737E05 | -7.63193E-04 | 1.32520E-03 | -9.55469E-06 | -5.19843E-04 | 3.30548E-03 | 2.48357E-03 | 3.02076E-04 | -3.11630E-04 | 1.28923E-01 | 0.99717647 | 0.98858635 | 0.98427087 | 0.93333189 |
|   3.6575E04 | -7.51499E-04 | 1.28031E-03 | -9.50868E-06 | -5.07667E-04 | 3.21707E-03 | 2.41924E-03 | 2.90161E-04 | -2.99670E-04 | 1.00570E-01 | 0.98189727 | 0.95509884 | 0.94649569 | 0.72807170 |
|   1.0427E04 | -6.96102E-04 | 1.17385E-03 | -7.49826E-06 | -4.76423E-04 | 3.04711E-03 | 2.28758E-03 | 2.83113E-04 | -2.90611E-04 | 5.25284E-02 | 0.90951638 | 0.87568072 | 0.91788320 | 0.38027684 |
#+TBLFM: $11=@@#$2/@2$2::$12=@@#$3/@2$3::$13=@@#$9/@2$9::$14=@@#$10/@2$10

#+begin_src python :session :results file :exports none :var data=meshConv
import matplotlib
import numpy as np
import matplotlib.pyplot as plt

matplotlib.use('Agg')
fig=plt.figure(figsize=(4,3))
plt.clf()
matplotlib.rcParams['mathtext.fontset'] = 'stix'
matplotlib.rcParams['font.family'] = 'STIXGeneral'
plt.rc('legend',fontsize=8) # using a size in points
arr = np.array(data,float)

#plot
plt.xlabel(r'number of DOFs')
plt.ylabel(r'Normalized quantities')
plt.plot(arr[:,0],arr[:,10],'ko',markerfacecolor='red',lw=0.2,ms=4,label=r'$d_{wc}$')
plt.plot(arr[:,0],arr[:,12],'ks',markerfacecolor='blue',lw=0.2,ms=4,label=r'$d_{ow}$')
plt.plot(arr[:,0],arr[:,11],'k^',markerfacecolor='green',lw=0.2,ms=4,label=r'$\langle u_o \rangle$')
#plt.plot(arr[:,0],arr[:,13],'kd--',markerfacecolor='yellow',lw=0.2,ms=4,label=r'$P_1-P_2$')
plt.xscale('log')
plt.ylim(0.7,1.1)
plt.legend(loc='lower right')
plt.tight_layout()
plt.savefig('DNS_meshConv.pdf')
'DNS_meshConv.pdf'
#+end_src

#+RESULTS:
[[file:DNS_meshConv.pdf]]

#+NAME: interfacemesh0
| 0.0030000 | 2.1451E-4 |
| 0.0030030 | 2.1460E-4 |
| 0.0030061 | 2.1473E-4 |
| 0.0030099 | 2.1506E-4 |
| 0.0030121 | 2.1529E-4 |
| 0.0030138 | 2.1540E-4 |
| 0.0030182 | 2.1581E-4 |
| 0.0030241 | 2.1654E-4 |
| 0.0030242 | 2.1656E-4 |
| 0.0030245 | 2.1660E-4 |
| 0.0030303 | 2.1746E-4 |
| 0.0030338 | 2.1798E-4 |
| 0.0030364 | 2.1836E-4 |
| 0.0030410 | 2.1926E-4 |
| 0.0030424 | 2.1957E-4 |
| 0.0030432 | 2.1970E-4 |
| 0.0030485 | 2.2082E-4 |
| 0.0030522 | 2.2161E-4 |
| 0.0030546 | 2.2212E-4 |
| 0.0030600 | 2.2352E-4 |
| 0.0030606 | 2.2368E-4 |
| 0.0030609 | 2.2374E-4 |
| 0.0030667 | 2.2534E-4 |
| 0.0030692 | 2.2603E-4 |
| 0.0030727 | 2.2702E-4 |
| 0.0030774 | 2.2845E-4 |
| 0.0030788 | 2.2885E-4 |
| 0.0030832 | 2.3031E-4 |
| 0.0030849 | 2.3089E-4 |
| 0.0030853 | 2.3104E-4 |
| 0.0030909 | 2.3299E-4 |
| 0.0030931 | 2.3372E-4 |
| 0.0030969 | 2.3512E-4 |
| 0.0031006 | 2.3648E-4 |
| 0.0031029 | 2.3734E-4 |
| 0.0031080 | 2.3935E-4 |
| 0.0031090 | 2.3970E-4 |
| 0.0031136 | 2.4163E-4 |
| 0.0031149 | 2.4217E-4 |
| 0.0031151 | 2.4225E-4 |
| 0.0031208 | 2.4469E-4 |
| 0.0031221 | 2.4522E-4 |
| 0.0031267 | 2.4723E-4 |
| 0.0031293 | 2.4836E-4 |
| 0.0031327 | 2.4986E-4 |
| 0.0031368 | 2.5172E-4 |
| 0.0031389 | 2.5263E-4 |
| 0.0031420 | 2.5414E-4 |
| 0.0031438 | 2.5500E-4 |
| 0.0031480 | 2.5698E-4 |
| 0.0031485 | 2.5721E-4 |
| 0.0031487 | 2.5728E-4 |
| 0.0031529 | 2.5930E-4 |
| 0.0031560 | 2.6082E-4 |
| 0.0031577 | 2.6170E-4 |
| 0.0031617 | 2.6362E-4 |
| 0.0031620 | 2.6374E-4 |
| 0.0031657 | 2.6559E-4 |
| 0.0031699 | 2.6767E-4 |
| 0.0031711 | 2.6820E-4 |
| 0.0031728 | 2.6911E-4 |
| 0.0031761 | 2.7081E-4 |
| 0.0031776 | 2.7155E-4 |
| 0.0031812 | 2.7332E-4 |
| 0.0031853 | 2.7540E-4 |
| 0.0031860 | 2.7572E-4 |
| 0.0031867 | 2.7609E-4 |
| 0.0031906 | 2.7814E-4 |
| 0.0031943 | 2.7999E-4 |
| 0.0031956 | 2.8059E-4 |
| 0.0031967 | 2.8120E-4 |
| 0.0032008 | 2.8328E-4 |
| 0.0032055 | 2.8566E-4 |
| 0.0032057 | 2.8577E-4 |
| 0.0032059 | 2.8589E-4 |
| 0.0032105 | 2.8822E-4 |
| 0.0032144 | 2.9014E-4 |
| 0.0032154 | 2.9061E-4 |
| 0.0032165 | 2.9119E-4 |
| 0.0032200 | 2.9299E-4 |
| 0.0032232 | 2.9459E-4 |
| 0.0032264 | 2.9614E-4 |
| 0.0032295 | 2.9763E-4 |
| 0.0032347 | 3.0016E-4 |
| 0.0032357 | 3.0066E-4 |
| 0.0032387 | 3.0213E-4 |
| 0.0032417 | 3.0363E-4 |
| 0.0032429 | 3.0416E-4 |
| 0.0032475 | 3.0635E-4 |
| 0.0032509 | 3.0791E-4 |
| 0.0032529 | 3.0884E-4 |
| 0.0032582 | 3.1130E-4 |
| 0.0032584 | 3.1140E-4 |
| 0.0032594 | 3.1187E-4 |
| 0.0032634 | 3.1372E-4 |
| 0.0032642 | 3.1406E-4 |
| 0.0032687 | 3.1611E-4 |
| 0.0032710 | 3.1707E-4 |
| 0.0032740 | 3.1838E-4 |
| 0.0032780 | 3.2008E-4 |
| 0.0032785 | 3.2031E-4 |
| 0.0032831 | 3.2222E-4 |
| 0.0032839 | 3.2254E-4 |
| 0.0032895 | 3.2490E-4 |
| 0.0032896 | 3.2497E-4 |
| 0.0032897 | 3.2498E-4 |
| 0.0032960 | 3.2757E-4 |
| 0.0032979 | 3.2829E-4 |
| 0.0033024 | 3.3004E-4 |
| 0.0033076 | 3.3202E-4 |
| 0.0033090 | 3.3250E-4 |
| 0.0033099 | 3.3287E-4 |
| 0.0033159 | 3.3504E-4 |
| 0.0033170 | 3.3543E-4 |
| 0.0033234 | 3.3772E-4 |
| 0.0033235 | 3.3775E-4 |
| 0.0033239 | 3.3791E-4 |
| 0.0033297 | 3.3992E-4 |
| 0.0033317 | 3.4055E-4 |
| 0.0033353 | 3.4169E-4 |
| 0.0033377 | 3.4248E-4 |
| 0.0033427 | 3.4407E-4 |
| 0.0033444 | 3.4453E-4 |
| 0.0033459 | 3.4505E-4 |
| 0.0033504 | 3.4639E-4 |
| 0.0033526 | 3.4702E-4 |
| 0.0033574 | 3.4839E-4 |
| 0.0033592 | 3.4890E-4 |
| 0.0033652 | 3.5054E-4 |
| 0.0033663 | 3.5080E-4 |
| 0.0033732 | 3.5261E-4 |
| 0.0033733 | 3.5264E-4 |
| 0.0033742 | 3.5288E-4 |
| 0.0033804 | 3.5438E-4 |
| 0.0033811 | 3.5455E-4 |
| 0.0033875 | 3.5603E-4 |
| 0.0033894 | 3.5642E-4 |
| 0.0033948 | 3.5758E-4 |
| 0.0033974 | 3.5810E-4 |
| 0.0034021 | 3.5901E-4 |
| 0.0034055 | 3.5963E-4 |
| 0.0034093 | 3.6033E-4 |
| 0.0034135 | 3.6105E-4 |
| 0.0034166 | 3.6155E-4 |
| 0.0034215 | 3.6232E-4 |
| 0.0034239 | 3.6268E-4 |
| 0.0034297 | 3.6351E-4 |
| 0.0034314 | 3.6373E-4 |
| 0.0034374 | 3.6453E-4 |
| 0.0034388 | 3.6472E-4 |
| 0.0034391 | 3.6477E-4 |
| 0.0034415 | 3.6503E-4 |
| 0.0034463 | 3.6553E-4 |
| 0.0034470 | 3.6561E-4 |
| 0.0034539 | 3.6628E-4 |
| 0.0034544 | 3.6632E-4 |
| 0.0034617 | 3.6692E-4 |
| 0.0034619 | 3.6693E-4 |
| 0.0034682 | 3.6737E-4 |
| 0.0034694 | 3.6745E-4 |
| 0.0034695 | 3.6745E-4 |
| 0.0034770 | 3.6785E-4 |
| 0.0034775 | 3.6787E-4 |
| 0.0034846 | 3.6813E-4 |
| 0.0034853 | 3.6815E-4 |
| 0.0034924 | 3.6829E-4 |
| 0.0034928 | 3.6830E-4 |
| 0.0035002 | 3.6833E-4 |
| 0.0035003 | 3.6833E-4 |
| 0.0035079 | 3.6826E-4 |
| 0.0035079 | 3.6826E-4 |
| 0.0035103 | 3.6821E-4 |
| 0.0035156 | 3.6807E-4 |
| 0.0035156 | 3.6807E-4 |
| 0.0035233 | 3.6777E-4 |
| 0.0035233 | 3.6777E-4 |
| 0.0035309 | 3.6735E-4 |
| 0.0035312 | 3.6733E-4 |
| 0.0035385 | 3.6682E-4 |
| 0.0035390 | 3.6678E-4 |
| 0.0035460 | 3.6618E-4 |
| 0.0035469 | 3.6609E-4 |
| 0.0035534 | 3.6543E-4 |
| 0.0035548 | 3.6529E-4 |
| 0.0035609 | 3.6457E-4 |
| 0.0035626 | 3.6437E-4 |
| 0.0035684 | 3.6360E-4 |
| 0.0035705 | 3.6332E-4 |
| 0.0035759 | 3.6252E-4 |
| 0.0035784 | 3.6215E-4 |
| 0.0035834 | 3.6133E-4 |
| 0.0035862 | 3.6086E-4 |
| 0.0035908 | 3.6006E-4 |
| 0.0035941 | 3.5945E-4 |
| 0.0035981 | 3.5869E-4 |
| 0.0036017 | 3.5797E-4 |
| 0.0036059 | 3.5708E-4 |
| 0.0036086 | 3.5646E-4 |
| 0.0036116 | 3.5582E-4 |
| 0.0036144 | 3.5520E-4 |
| 0.0036193 | 3.5404E-4 |
| 0.0036207 | 3.5371E-4 |
| 0.0036265 | 3.5223E-4 |
| 0.0036272 | 3.5207E-4 |
| 0.0036333 | 3.5042E-4 |
| 0.0036335 | 3.5038E-4 |
| 0.0036389 | 3.4892E-4 |
| 0.0036417 | 3.4807E-4 |
| 0.0036437 | 3.4743E-4 |
| 0.0036448 | 3.4713E-4 |
| 0.0036497 | 3.4567E-4 |
| 0.0036520 | 3.4495E-4 |
| 0.0036563 | 3.4361E-4 |
| 0.0036596 | 3.4254E-4 |
| 0.0036631 | 3.4139E-4 |
| 0.0036676 | 3.3988E-4 |
| 0.0036700 | 3.3906E-4 |
| 0.0036758 | 3.3698E-4 |
| 0.0036768 | 3.3662E-4 |
| 0.0036831 | 3.3427E-4 |
| 0.0036838 | 3.3399E-4 |
| 0.0036839 | 3.3396E-4 |
| 0.0036918 | 3.3090E-4 |
| 0.0036919 | 3.3086E-4 |
| 0.0036920 | 3.3080E-4 |
| 0.0036983 | 3.2823E-4 |
| 0.0037014 | 3.2699E-4 |
| 0.0037048 | 3.2562E-4 |
| 0.0037094 | 3.2363E-4 |
| 0.0037110 | 3.2293E-4 |
| 0.0037165 | 3.2048E-4 |
| 0.0037170 | 3.2026E-4 |
| 0.0037220 | 3.1802E-4 |
| 0.0037241 | 3.1704E-4 |
| 0.0037265 | 3.1588E-4 |
| 0.0037279 | 3.1521E-4 |
| 0.0037317 | 3.1345E-4 |
| 0.0037347 | 3.1202E-4 |
| 0.0037373 | 3.1077E-4 |
| 0.0037414 | 3.0879E-4 |
| 0.0037429 | 3.0803E-4 |
| 0.0037478 | 3.0558E-4 |
| 0.0037486 | 3.0518E-4 |
| 0.0037549 | 3.0195E-4 |
| 0.0037549 | 3.0192E-4 |
| 0.0037550 | 3.0187E-4 |
| 0.0037599 | 2.9933E-4 |
| 0.0037631 | 2.9763E-4 |
| 0.0037646 | 2.9689E-4 |
| 0.0037684 | 2.9491E-4 |
| 0.0037692 | 2.9445E-4 |
| 0.0037727 | 2.9252E-4 |
| 0.0037739 | 2.9184E-4 |
| 0.0037743 | 2.9167E-4 |
| 0.0037783 | 2.8947E-4 |
| 0.0037803 | 2.8841E-4 |
| 0.0037829 | 2.8696E-4 |
| 0.0037864 | 2.8514E-4 |
| 0.0037878 | 2.8439E-4 |
| 0.0037917 | 2.8214E-4 |
| 0.0037925 | 2.8167E-4 |
| 0.0037928 | 2.8153E-4 |
| 0.0037973 | 2.7905E-4 |
| 0.0037995 | 2.7788E-4 |
| 0.0038022 | 2.7634E-4 |
| 0.0038065 | 2.7399E-4 |
| 0.0038071 | 2.7367E-4 |
| 0.0038088 | 2.7274E-4 |
| 0.0038122 | 2.7079E-4 |
| 0.0038133 | 2.7016E-4 |
| 0.0038177 | 2.6779E-4 |
| 0.0038206 | 2.6626E-4 |
| 0.0038240 | 2.6432E-4 |
| 0.0038262 | 2.6310E-4 |
| 0.0038302 | 2.6102E-4 |
| 0.0038309 | 2.6065E-4 |
| 0.0038324 | 2.5989E-4 |
| 0.0038357 | 2.5809E-4 |
| 0.0038366 | 2.5762E-4 |
| 0.0038405 | 2.5554E-4 |
| 0.0038431 | 2.5425E-4 |
| 0.0038455 | 2.5309E-4 |
| 0.0038494 | 2.5105E-4 |
| 0.0038503 | 2.5059E-4 |
| 0.0038542 | 2.4871E-4 |
| 0.0038585 | 2.4660E-4 |
| 0.0038595 | 2.4609E-4 |
| 0.0038606 | 2.4556E-4 |
| 0.0038644 | 2.4382E-4 |
| 0.0038667 | 2.4277E-4 |
| 0.0038706 | 2.4099E-4 |
| 0.0038728 | 2.4006E-4 |
| 0.0038777 | 2.3793E-4 |
| 0.0038788 | 2.3748E-4 |
| 0.0038847 | 2.3504E-4 |
| 0.0038847 | 2.3503E-4 |
| 0.0038848 | 2.3503E-4 |
| 0.0038908 | 2.3263E-4 |
| 0.0038922 | 2.3215E-4 |
| 0.0038969 | 2.3041E-4 |
| 0.0038999 | 2.2942E-4 |
| 0.0039030 | 2.2839E-4 |
| 0.0039078 | 2.2684E-4 |
| 0.0039091 | 2.2647E-4 |
| 0.0039128 | 2.2530E-4 |
| 0.0039151 | 2.2459E-4 |
| 0.0039160 | 2.2438E-4 |
| 0.0039212 | 2.2294E-4 |
| 0.0039244 | 2.2215E-4 |
| 0.0039273 | 2.2150E-4 |
| 0.0039333 | 2.2011E-4 |
| 0.0039333 | 2.2009E-4 |
| 0.0039335 | 2.2006E-4 |
| 0.0039394 | 2.1882E-4 |
| 0.0039424 | 2.1830E-4 |
| 0.0039454 | 2.1783E-4 |
| 0.0039506 | 2.1698E-4 |
| 0.0039515 | 2.1682E-4 |
| 0.0039521 | 2.1676E-4 |
| 0.0039576 | 2.1603E-4 |
| 0.0039622 | 2.1555E-4 |
| 0.0039636 | 2.1544E-4 |
| 0.0039656 | 2.1522E-4 |
| 0.0039697 | 2.1484E-4 |
| 0.0039729 | 2.1467E-4 |
| 0.0039758 | 2.1457E-4 |
| 0.0039791 | 2.1438E-4 |
| 0.0039818 | 2.1424E-4 |
| 0.0039843 | 2.1423E-4 |
| 0.0039879 | 2.1425E-4 |
| 0.0039915 | 2.1421E-4 |
| 0.0039939 | 2.1420E-4 |
| 0.0039966 | 2.1431E-4 |
| 0.0040000 | 2.1449E-4 |

#+NAME: interfacemesh
| 0.0030000 | 2.1526E-4 |
| 0.0030028 | 2.1538E-4 |
| 0.0030035 | 2.1539E-4 |
| 0.0030041 | 2.1544E-4 |
| 0.0030070 | 2.1562E-4 |
| 0.0030104 | 2.1580E-4 |
| 0.0030105 | 2.1580E-4 |
| 0.0030105 | 2.1580E-4 |
| 0.0030140 | 2.1617E-4 |
| 0.0030164 | 2.1643E-4 |
| 0.0030175 | 2.1654E-4 |
| 0.0030189 | 2.1669E-4 |
| 0.0030209 | 2.1693E-4 |
| 0.0030223 | 2.1710E-4 |
| 0.0030244 | 2.1738E-4 |
| 0.0030278 | 2.1786E-4 |
| 0.0030279 | 2.1788E-4 |
| 0.0030280 | 2.1789E-4 |
| 0.0030314 | 2.1839E-4 |
| 0.0030336 | 2.1875E-4 |
| 0.0030349 | 2.1894E-4 |
| 0.0030372 | 2.1933E-4 |
| 0.0030384 | 2.1955E-4 |
| 0.0030390 | 2.1968E-4 |
| 0.0030419 | 2.2020E-4 |
| 0.0030443 | 2.2070E-4 |
| 0.0030454 | 2.2093E-4 |
| 0.0030475 | 2.2136E-4 |
| 0.0030488 | 2.2165E-4 |
| 0.0030495 | 2.2181E-4 |
| 0.0030523 | 2.2245E-4 |
| 0.0030546 | 2.2297E-4 |
| 0.0030558 | 2.2328E-4 |
| 0.0030588 | 2.2405E-4 |
| 0.0030593 | 2.2416E-4 |
| 0.0030595 | 2.2421E-4 |
| 0.0030628 | 2.2504E-4 |
| 0.0030644 | 2.2547E-4 |
| 0.0030662 | 2.2595E-4 |
| 0.0030692 | 2.2677E-4 |
| 0.0030697 | 2.2693E-4 |
| 0.0030712 | 2.2733E-4 |
| 0.0030732 | 2.2789E-4 |
| 0.0030739 | 2.2811E-4 |
| 0.0030767 | 2.2898E-4 |
| 0.0030784 | 2.2955E-4 |
| 0.0030801 | 2.3009E-4 |
| 0.0030829 | 2.3101E-4 |
| 0.0030836 | 2.3123E-4 |
| 0.0030858 | 2.3197E-4 |
| 0.0030870 | 2.3238E-4 |
| 0.0030874 | 2.3250E-4 |
| 0.0030905 | 2.3357E-4 |
| 0.0030918 | 2.3403E-4 |
| 0.0030940 | 2.3482E-4 |
| 0.0030961 | 2.3559E-4 |
| 0.0030974 | 2.3609E-4 |
| 0.0031003 | 2.3720E-4 |
| 0.0031009 | 2.3741E-4 |
| 0.0031034 | 2.3838E-4 |
| 0.0031043 | 2.3874E-4 |
| 0.0031045 | 2.3883E-4 |
| 0.0031077 | 2.4002E-4 |
| 0.0031088 | 2.4044E-4 |
| 0.0031112 | 2.4141E-4 |
| 0.0031129 | 2.4211E-4 |
| 0.0031146 | 2.4278E-4 |
| 0.0031171 | 2.4382E-4 |
| 0.0031180 | 2.4416E-4 |
| 0.0031213 | 2.4556E-4 |
| 0.0031213 | 2.4559E-4 |
| 0.0031216 | 2.4568E-4 |
| 0.0031247 | 2.4701E-4 |
| 0.0031254 | 2.4731E-4 |
| 0.0031279 | 2.4845E-4 |
| 0.0031294 | 2.4909E-4 |
| 0.0031312 | 2.4990E-4 |
| 0.0031333 | 2.5087E-4 |
| 0.0031344 | 2.5138E-4 |
| 0.0031377 | 2.5287E-4 |
| 0.0031377 | 2.5287E-4 |
| 0.0031377 | 2.5288E-4 |
| 0.0031412 | 2.5445E-4 |
| 0.0031421 | 2.5491E-4 |
| 0.0031447 | 2.5608E-4 |
| 0.0031472 | 2.5730E-4 |
| 0.0031479 | 2.5762E-4 |
| 0.0031504 | 2.5884E-4 |
| 0.0031507 | 2.5898E-4 |
| 0.0031508 | 2.5902E-4 |
| 0.0031536 | 2.6032E-4 |
| 0.0031552 | 2.6113E-4 |
| 0.0031564 | 2.6169E-4 |
| 0.0031572 | 2.6205E-4 |
| 0.0031593 | 2.6306E-4 |
| 0.0031619 | 2.6434E-4 |
| 0.0031621 | 2.6445E-4 |
| 0.0031624 | 2.6456E-4 |
| 0.0031653 | 2.6599E-4 |
| 0.0031678 | 2.6725E-4 |
| 0.0031684 | 2.6752E-4 |
| 0.0031691 | 2.6785E-4 |
| 0.0031715 | 2.6907E-4 |
| 0.0031744 | 2.7050E-4 |
| 0.0031746 | 2.7058E-4 |
| 0.0031747 | 2.7064E-4 |
| 0.0031776 | 2.7212E-4 |
| 0.0031796 | 2.7313E-4 |
| 0.0031807 | 2.7366E-4 |
| 0.0031821 | 2.7439E-4 |
| 0.0031835 | 2.7506E-4 |
| 0.0031846 | 2.7564E-4 |
| 0.0031864 | 2.7654E-4 |
| 0.0031886 | 2.7769E-4 |
| 0.0031893 | 2.7803E-4 |
| 0.0031902 | 2.7851E-4 |
| 0.0031928 | 2.7979E-4 |
| 0.0031946 | 2.8066E-4 |
| 0.0031963 | 2.8154E-4 |
| 0.0031989 | 2.8284E-4 |
| 0.0031997 | 2.8324E-4 |
| 0.0032000 | 2.8341E-4 |
| 0.0032021 | 2.8444E-4 |
| 0.0032036 | 2.8518E-4 |
| 0.0032039 | 2.8536E-4 |
| 0.0032072 | 2.8700E-4 |
| 0.0032083 | 2.8760E-4 |
| 0.0032108 | 2.8884E-4 |
| 0.0032129 | 2.8990E-4 |
| 0.0032142 | 2.9055E-4 |
| 0.0032176 | 2.9230E-4 |
| 0.0032176 | 2.9231E-4 |
| 0.0032177 | 2.9232E-4 |
| 0.0032211 | 2.9403E-4 |
| 0.0032224 | 2.9466E-4 |
| 0.0032244 | 2.9563E-4 |
| 0.0032271 | 2.9693E-4 |
| 0.0032278 | 2.9727E-4 |
| 0.0032294 | 2.9803E-4 |
| 0.0032311 | 2.9884E-4 |
| 0.0032318 | 2.9918E-4 |
| 0.0032344 | 3.0050E-4 |
| 0.0032364 | 3.0146E-4 |
| 0.0032377 | 3.0214E-4 |
| 0.0032410 | 3.0372E-4 |
| 0.0032411 | 3.0374E-4 |
| 0.0032412 | 3.0378E-4 |
| 0.0032444 | 3.0534E-4 |
| 0.0032458 | 3.0598E-4 |
| 0.0032478 | 3.0695E-4 |
| 0.0032505 | 3.0826E-4 |
| 0.0032512 | 3.0858E-4 |
| 0.0032531 | 3.0944E-4 |
| 0.0032545 | 3.1008E-4 |
| 0.0032550 | 3.1032E-4 |
| 0.0032580 | 3.1166E-4 |
| 0.0032596 | 3.1238E-4 |
| 0.0032614 | 3.1321E-4 |
| 0.0032640 | 3.1436E-4 |
| 0.0032648 | 3.1470E-4 |
| 0.0032675 | 3.1590E-4 |
| 0.0032682 | 3.1619E-4 |
| 0.0032683 | 3.1627E-4 |
| 0.0032716 | 3.1771E-4 |
| 0.0032726 | 3.1814E-4 |
| 0.0032750 | 3.1919E-4 |
| 0.0032768 | 3.1999E-4 |
| 0.0032784 | 3.2065E-4 |
| 0.0032811 | 3.2182E-4 |
| 0.0032817 | 3.2209E-4 |
| 0.0032843 | 3.2313E-4 |
| 0.0032851 | 3.2349E-4 |
| 0.0032853 | 3.2359E-4 |
| 0.0032885 | 3.2489E-4 |
| 0.0032896 | 3.2534E-4 |
| 0.0032919 | 3.2629E-4 |
| 0.0032938 | 3.2705E-4 |
| 0.0032953 | 3.2765E-4 |
| 0.0032979 | 3.2868E-4 |
| 0.0032987 | 3.2901E-4 |
| 0.0033020 | 3.3031E-4 |
| 0.0033021 | 3.3036E-4 |
| 0.0033028 | 3.3061E-4 |
| 0.0033055 | 3.3161E-4 |
| 0.0033061 | 3.3184E-4 |
| 0.0033089 | 3.3291E-4 |
| 0.0033102 | 3.3338E-4 |
| 0.0033124 | 3.3418E-4 |
| 0.0033143 | 3.3488E-4 |
| 0.0033158 | 3.3541E-4 |
| 0.0033185 | 3.3635E-4 |
| 0.0033193 | 3.3664E-4 |
| 0.0033227 | 3.3779E-4 |
| 0.0033228 | 3.3784E-4 |
| 0.0033235 | 3.3809E-4 |
| 0.0033263 | 3.3904E-4 |
| 0.0033268 | 3.3920E-4 |
| 0.0033298 | 3.4023E-4 |
| 0.0033309 | 3.4060E-4 |
| 0.0033333 | 3.4141E-4 |
| 0.0033351 | 3.4197E-4 |
| 0.0033369 | 3.4257E-4 |
| 0.0033392 | 3.4329E-4 |
| 0.0033404 | 3.4370E-4 |
| 0.0033433 | 3.4460E-4 |
| 0.0033440 | 3.4481E-4 |
| 0.0033475 | 3.4586E-4 |
| 0.0033476 | 3.4590E-4 |
| 0.0033485 | 3.4615E-4 |
| 0.0033512 | 3.4695E-4 |
| 0.0033516 | 3.4708E-4 |
| 0.0033548 | 3.4799E-4 |
| 0.0033558 | 3.4827E-4 |
| 0.0033584 | 3.4901E-4 |
| 0.0033599 | 3.4944E-4 |
| 0.0033621 | 3.5003E-4 |
| 0.0033641 | 3.5059E-4 |
| 0.0033657 | 3.5102E-4 |
| 0.0033682 | 3.5166E-4 |
| 0.0033693 | 3.5195E-4 |
| 0.0033724 | 3.5273E-4 |
| 0.0033731 | 3.5290E-4 |
| 0.0033765 | 3.5376E-4 |
| 0.0033768 | 3.5381E-4 |
| 0.0033785 | 3.5422E-4 |
| 0.0033804 | 3.5465E-4 |
| 0.0033806 | 3.5470E-4 |
| 0.0033841 | 3.5550E-4 |
| 0.0033847 | 3.5564E-4 |
| 0.0033878 | 3.5632E-4 |
| 0.0033888 | 3.5654E-4 |
| 0.0033914 | 3.5708E-4 |
| 0.0033928 | 3.5738E-4 |
| 0.0033951 | 3.5785E-4 |
| 0.0033969 | 3.5822E-4 |
| 0.0033988 | 3.5859E-4 |
| 0.0034010 | 3.5901E-4 |
| 0.0034024 | 3.5928E-4 |
| 0.0034050 | 3.5976E-4 |
| 0.0034061 | 3.5997E-4 |
| 0.0034091 | 3.6050E-4 |
| 0.0034098 | 3.6063E-4 |
| 0.0034131 | 3.6118E-4 |
| 0.0034134 | 3.6124E-4 |
| 0.0034163 | 3.6171E-4 |
| 0.0034170 | 3.6183E-4 |
| 0.0034171 | 3.6185E-4 |
| 0.0034207 | 3.6241E-4 |
| 0.0034212 | 3.6249E-4 |
| 0.0034244 | 3.6296E-4 |
| 0.0034252 | 3.6308E-4 |
| 0.0034280 | 3.6349E-4 |
| 0.0034292 | 3.6366E-4 |
| 0.0034316 | 3.6399E-4 |
| 0.0034333 | 3.6420E-4 |
| 0.0034353 | 3.6446E-4 |
| 0.0034372 | 3.6470E-4 |
| 0.0034390 | 3.6492E-4 |
| 0.0034412 | 3.6518E-4 |
| 0.0034427 | 3.6535E-4 |
| 0.0034452 | 3.6561E-4 |
| 0.0034465 | 3.6575E-4 |
| 0.0034491 | 3.6601E-4 |
| 0.0034502 | 3.6613E-4 |
| 0.0034530 | 3.6639E-4 |
| 0.0034540 | 3.6648E-4 |
| 0.0034569 | 3.6672E-4 |
| 0.0034579 | 3.6680E-4 |
| 0.0034608 | 3.6703E-4 |
| 0.0034617 | 3.6710E-4 |
| 0.0034648 | 3.6731E-4 |
| 0.0034655 | 3.6737E-4 |
| 0.0034686 | 3.6756E-4 |
| 0.0034694 | 3.6760E-4 |
| 0.0034725 | 3.6778E-4 |
| 0.0034732 | 3.6781E-4 |
| 0.0034764 | 3.6797E-4 |
| 0.0034771 | 3.6800E-4 |
| 0.0034803 | 3.6812E-4 |
| 0.0034809 | 3.6815E-4 |
| 0.0034842 | 3.6825E-4 |
| 0.0034848 | 3.6827E-4 |
| 0.0034881 | 3.6835E-4 |
| 0.0034886 | 3.6837E-4 |
| 0.0034919 | 3.6842E-4 |
| 0.0034925 | 3.6843E-4 |
| 0.0034958 | 3.6846E-4 |
| 0.0034964 | 3.6847E-4 |
| 0.0034997 | 3.6848E-4 |
| 0.0035002 | 3.6848E-4 |
| 0.0035035 | 3.6846E-4 |
| 0.0035041 | 3.6845E-4 |
| 0.0035074 | 3.6841E-4 |
| 0.0035079 | 3.6840E-4 |
| 0.0035113 | 3.6833E-4 |
| 0.0035118 | 3.6832E-4 |
| 0.0035152 | 3.6823E-4 |
| 0.0035157 | 3.6821E-4 |
| 0.0035190 | 3.6809E-4 |
| 0.0035195 | 3.6807E-4 |
| 0.0035229 | 3.6793E-4 |
| 0.0035234 | 3.6791E-4 |
| 0.0035268 | 3.6773E-4 |
| 0.0035273 | 3.6770E-4 |
| 0.0035306 | 3.6751E-4 |
| 0.0035312 | 3.6748E-4 |
| 0.0035345 | 3.6726E-4 |
| 0.0035351 | 3.6722E-4 |
| 0.0035383 | 3.6698E-4 |
| 0.0035390 | 3.6693E-4 |
| 0.0035422 | 3.6667E-4 |
| 0.0035429 | 3.6661E-4 |
| 0.0035460 | 3.6633E-4 |
| 0.0035468 | 3.6626E-4 |
| 0.0035498 | 3.6596E-4 |
| 0.0035507 | 3.6588E-4 |
| 0.0035536 | 3.6557E-4 |
| 0.0035545 | 3.6547E-4 |
| 0.0035574 | 3.6515E-4 |
| 0.0035584 | 3.6503E-4 |
| 0.0035612 | 3.6470E-4 |
| 0.0035624 | 3.6455E-4 |
| 0.0035649 | 3.6422E-4 |
| 0.0035663 | 3.6404E-4 |
| 0.0035687 | 3.6371E-4 |
| 0.0035702 | 3.6351E-4 |
| 0.0035725 | 3.6318E-4 |
| 0.0035741 | 3.6294E-4 |
| 0.0035761 | 3.6263E-4 |
| 0.0035780 | 3.6234E-4 |
| 0.0035798 | 3.6205E-4 |
| 0.0035819 | 3.6171E-4 |
| 0.0035835 | 3.6145E-4 |
| 0.0035860 | 3.6102E-4 |
| 0.0035871 | 3.6083E-4 |
| 0.0035900 | 3.6030E-4 |
| 0.0035907 | 3.6017E-4 |
| 0.0035943 | 3.5951E-4 |
| 0.0035943 | 3.5951E-4 |
| 0.0035946 | 3.5946E-4 |
| 0.0035979 | 3.5881E-4 |
| 0.0035984 | 3.5872E-4 |
| 0.0036015 | 3.5810E-4 |
| 0.0036025 | 3.5790E-4 |
| 0.0036052 | 3.5735E-4 |
| 0.0036068 | 3.5701E-4 |
| 0.0036089 | 3.5655E-4 |
| 0.0036108 | 3.5613E-4 |
| 0.0036125 | 3.5576E-4 |
| 0.0036149 | 3.5521E-4 |
| 0.0036161 | 3.5493E-4 |
| 0.0036190 | 3.5426E-4 |
| 0.0036197 | 3.5407E-4 |
| 0.0036230 | 3.5329E-4 |
| 0.0036233 | 3.5322E-4 |
| 0.0036259 | 3.5255E-4 |
| 0.0036269 | 3.5231E-4 |
| 0.0036270 | 3.5228E-4 |
| 0.0036305 | 3.5136E-4 |
| 0.0036310 | 3.5123E-4 |
| 0.0036340 | 3.5042E-4 |
| 0.0036350 | 3.5016E-4 |
| 0.0036376 | 3.4942E-4 |
| 0.0036390 | 3.4902E-4 |
| 0.0036412 | 3.4839E-4 |
| 0.0036431 | 3.4786E-4 |
| 0.0036448 | 3.4735E-4 |
| 0.0036471 | 3.4666E-4 |
| 0.0036483 | 3.4629E-4 |
| 0.0036512 | 3.4541E-4 |
| 0.0036519 | 3.4520E-4 |
| 0.0036553 | 3.4413E-4 |
| 0.0036554 | 3.4409E-4 |
| 0.0036562 | 3.4383E-4 |
| 0.0036589 | 3.4297E-4 |
| 0.0036594 | 3.4281E-4 |
| 0.0036624 | 3.4181E-4 |
| 0.0036635 | 3.4146E-4 |
| 0.0036660 | 3.4062E-4 |
| 0.0036676 | 3.4007E-4 |
| 0.0036695 | 3.3941E-4 |
| 0.0036717 | 3.3864E-4 |
| 0.0036730 | 3.3818E-4 |
| 0.0036757 | 3.3718E-4 |
| 0.0036764 | 3.3692E-4 |
| 0.0036799 | 3.3566E-4 |
| 0.0036800 | 3.3563E-4 |
| 0.0036804 | 3.3550E-4 |
| 0.0036835 | 3.3435E-4 |
| 0.0036841 | 3.3413E-4 |
| 0.0036869 | 3.3304E-4 |
| 0.0036882 | 3.3255E-4 |
| 0.0036905 | 3.3169E-4 |
| 0.0036925 | 3.3089E-4 |
| 0.0036940 | 3.3030E-4 |
| 0.0036966 | 3.2926E-4 |
| 0.0036974 | 3.2895E-4 |
| 0.0037009 | 3.2754E-4 |
| 0.0037009 | 3.2752E-4 |
| 0.0037011 | 3.2744E-4 |
| 0.0037044 | 3.2605E-4 |
| 0.0037051 | 3.2577E-4 |
| 0.0037078 | 3.2461E-4 |
| 0.0037092 | 3.2400E-4 |
| 0.0037113 | 3.2309E-4 |
| 0.0037135 | 3.2216E-4 |
| 0.0037148 | 3.2156E-4 |
| 0.0037176 | 3.2031E-4 |
| 0.0037183 | 3.2001E-4 |
| 0.0037213 | 3.1864E-4 |
| 0.0037218 | 3.1845E-4 |
| 0.0037219 | 3.1841E-4 |
| 0.0037253 | 3.1685E-4 |
| 0.0037261 | 3.1648E-4 |
| 0.0037287 | 3.1522E-4 |
| 0.0037303 | 3.1450E-4 |
| 0.0037323 | 3.1355E-4 |
| 0.0037345 | 3.1247E-4 |
| 0.0037357 | 3.1189E-4 |
| 0.0037387 | 3.1043E-4 |
| 0.0037392 | 3.1020E-4 |
| 0.0037408 | 3.0944E-4 |
| 0.0037427 | 3.0852E-4 |
| 0.0037433 | 3.0822E-4 |
| 0.0037461 | 3.0684E-4 |
| 0.0037477 | 3.0606E-4 |
| 0.0037495 | 3.0517E-4 |
| 0.0037521 | 3.0385E-4 |
| 0.0037528 | 3.0349E-4 |
| 0.0037551 | 3.0234E-4 |
| 0.0037562 | 3.0178E-4 |
| 0.0037565 | 3.0160E-4 |
| 0.0037595 | 3.0010E-4 |
| 0.0037609 | 2.9937E-4 |
| 0.0037627 | 2.9837E-4 |
| 0.0037652 | 2.9707E-4 |
| 0.0037660 | 2.9664E-4 |
| 0.0037685 | 2.9533E-4 |
| 0.0037693 | 2.9492E-4 |
| 0.0037695 | 2.9479E-4 |
| 0.0037726 | 2.9316E-4 |
| 0.0037739 | 2.9243E-4 |
| 0.0037759 | 2.9138E-4 |
| 0.0037783 | 2.9005E-4 |
| 0.0037792 | 2.8957E-4 |
| 0.0037828 | 2.8760E-4 |
| 0.0037830 | 2.8751E-4 |
| 0.0037835 | 2.8724E-4 |
| 0.0037864 | 2.8565E-4 |
| 0.0037875 | 2.8512E-4 |
| 0.0037899 | 2.8379E-4 |
| 0.0037925 | 2.8236E-4 |
| 0.0037931 | 2.8203E-4 |
| 0.0037939 | 2.8159E-4 |
| 0.0037963 | 2.8027E-4 |
| 0.0037980 | 2.7930E-4 |
| 0.0037995 | 2.7850E-4 |
| 0.0038017 | 2.7727E-4 |
| 0.0038026 | 2.7682E-4 |
| 0.0038032 | 2.7650E-4 |
| 0.0038056 | 2.7512E-4 |
| 0.0038082 | 2.7364E-4 |
| 0.0038087 | 2.7338E-4 |
| 0.0038094 | 2.7302E-4 |
| 0.0038117 | 2.7178E-4 |
| 0.0038134 | 2.7087E-4 |
| 0.0038147 | 2.7012E-4 |
| 0.0038166 | 2.6913E-4 |
| 0.0038178 | 2.6852E-4 |
| 0.0038186 | 2.6808E-4 |
| 0.0038207 | 2.6687E-4 |
| 0.0038237 | 2.6526E-4 |
| 0.0038237 | 2.6526E-4 |
| 0.0038237 | 2.6525E-4 |
| 0.0038266 | 2.6364E-4 |
| 0.0038289 | 2.6245E-4 |
| 0.0038295 | 2.6208E-4 |
| 0.0038304 | 2.6164E-4 |
| 0.0038325 | 2.6052E-4 |
| 0.0038342 | 2.5962E-4 |
| 0.0038354 | 2.5898E-4 |
| 0.0038371 | 2.5815E-4 |
| 0.0038385 | 2.5737E-4 |
| 0.0038396 | 2.5682E-4 |
| 0.0038416 | 2.5576E-4 |
| 0.0038443 | 2.5435E-4 |
| 0.0038446 | 2.5417E-4 |
| 0.0038448 | 2.5407E-4 |
| 0.0038479 | 2.5250E-4 |
| 0.0038502 | 2.5132E-4 |
| 0.0038512 | 2.5081E-4 |
| 0.0038528 | 2.5000E-4 |
| 0.0038546 | 2.4916E-4 |
| 0.0038554 | 2.4873E-4 |
| 0.0038579 | 2.4758E-4 |
| 0.0038597 | 2.4672E-4 |
| 0.0038616 | 2.4584E-4 |
| 0.0038636 | 2.4488E-4 |
| 0.0038655 | 2.4403E-4 |
| 0.0038676 | 2.4308E-4 |
| 0.0038689 | 2.4251E-4 |
| 0.0038715 | 2.4131E-4 |
| 0.0038722 | 2.4100E-4 |
| 0.0038754 | 2.3966E-4 |
| 0.0038757 | 2.3954E-4 |
| 0.0038758 | 2.3952E-4 |
| 0.0038791 | 2.3809E-4 |
| 0.0038799 | 2.3777E-4 |
| 0.0038825 | 2.3668E-4 |
| 0.0038840 | 2.3605E-4 |
| 0.0038859 | 2.3532E-4 |
| 0.0038883 | 2.3438E-4 |
| 0.0038893 | 2.3399E-4 |
| 0.0038926 | 2.3276E-4 |
| 0.0038927 | 2.3272E-4 |
| 0.0038930 | 2.3261E-4 |
| 0.0038961 | 2.3149E-4 |
| 0.0038969 | 2.3118E-4 |
| 0.0038995 | 2.3028E-4 |
| 0.0039013 | 2.2964E-4 |
| 0.0039029 | 2.2911E-4 |
| 0.0039057 | 2.2814E-4 |
| 0.0039063 | 2.2796E-4 |
| 0.0039079 | 2.2746E-4 |
| 0.0039097 | 2.2694E-4 |
| 0.0039103 | 2.2674E-4 |
| 0.0039131 | 2.2592E-4 |
| 0.0039150 | 2.2541E-4 |
| 0.0039165 | 2.2497E-4 |
| 0.0039198 | 2.2411E-4 |
| 0.0039200 | 2.2404E-4 |
| 0.0039206 | 2.2390E-4 |
| 0.0039234 | 2.2314E-4 |
| 0.0039246 | 2.2284E-4 |
| 0.0039269 | 2.2229E-4 |
| 0.0039295 | 2.2166E-4 |
| 0.0039303 | 2.2146E-4 |
| 0.0039321 | 2.2109E-4 |
| 0.0039338 | 2.2072E-4 |
| 0.0039346 | 2.2054E-4 |
| 0.0039373 | 2.1999E-4 |
| 0.0039399 | 2.1950E-4 |
| 0.0039407 | 2.1933E-4 |
| 0.0039424 | 2.1903E-4 |
| 0.0039442 | 2.1872E-4 |
| 0.0039453 | 2.1857E-4 |
| 0.0039477 | 2.1817E-4 |
| 0.0039508 | 2.1771E-4 |
| 0.0039512 | 2.1766E-4 |
| 0.0039517 | 2.1758E-4 |
| 0.0039547 | 2.1718E-4 |
| 0.0039565 | 2.1694E-4 |
| 0.0039581 | 2.1674E-4 |
| 0.0039605 | 2.1648E-4 |
| 0.0039616 | 2.1637E-4 |
| 0.0039624 | 2.1629E-4 |
| 0.0039651 | 2.1602E-4 |
| 0.0039684 | 2.1568E-4 |
| 0.0039686 | 2.1566E-4 |
| 0.0039689 | 2.1565E-4 |
| 0.0039721 | 2.1550E-4 |
| 0.0039748 | 2.1534E-4 |
| 0.0039756 | 2.1529E-4 |
| 0.0039764 | 2.1528E-4 |
| 0.0039791 | 2.1519E-4 |
| 0.0039814 | 2.1510E-4 |
| 0.0039825 | 2.1504E-4 |
| 0.0039838 | 2.1503E-4 |
| 0.0039860 | 2.1500E-4 |
| 0.0039881 | 2.1494E-4 |
| 0.0039895 | 2.1492E-4 |
| 0.0039909 | 2.1495E-4 |
| 0.0039930 | 2.1502E-4 |
| 0.0039953 | 2.1506E-4 |
| 0.0039965 | 2.1508E-4 |
| 0.0039976 | 2.1515E-4 |
| 0.0040000 | 2.1525E-4 |

#+NAME: interfacemesh4
| 0.0030000 | 2.2016E-4 |
| 0.0030026 | 2.2034E-4 |
| 0.0030084 | 2.2091E-4 |
| 0.0030124 | 2.2138E-4 |
| 0.0030168 | 2.2190E-4 |
| 0.0030238 | 2.2286E-4 |
| 0.0030253 | 2.2307E-4 |
| 0.0030261 | 2.2323E-4 |
| 0.0030337 | 2.2455E-4 |
| 0.0030391 | 2.2560E-4 |
| 0.0030420 | 2.2621E-4 |
| 0.0030484 | 2.2767E-4 |
| 0.0030504 | 2.2811E-4 |
| 0.0030513 | 2.2834E-4 |
| 0.0030588 | 2.3018E-4 |
| 0.0030631 | 2.3135E-4 |
| 0.0030672 | 2.3246E-4 |
| 0.0030744 | 2.3457E-4 |
| 0.0030754 | 2.3484E-4 |
| 0.0030783 | 2.3574E-4 |
| 0.0030837 | 2.3742E-4 |
| 0.0030854 | 2.3801E-4 |
| 0.0030921 | 2.4028E-4 |
| 0.0030960 | 2.4163E-4 |
| 0.0031005 | 2.4325E-4 |
| 0.0031054 | 2.4515E-4 |
| 0.0031073 | 2.4587E-4 |
| 0.0031141 | 2.4857E-4 |
| 0.0031141 | 2.4858E-4 |
| 0.0031142 | 2.4863E-4 |
| 0.0031209 | 2.5147E-4 |
| 0.0031225 | 2.5216E-4 |
| 0.0031298 | 2.5541E-4 |
| 0.0031316 | 2.5617E-4 |
| 0.0031351 | 2.5776E-4 |
| 0.0031384 | 2.5926E-4 |
| 0.0031401 | 2.6003E-4 |
| 0.0031452 | 2.6241E-4 |
| 0.0031504 | 2.6482E-4 |
| 0.0031520 | 2.6559E-4 |
| 0.0031552 | 2.6715E-4 |
| 0.0031613 | 2.7007E-4 |
| 0.0031665 | 2.7253E-4 |
| 0.0031705 | 2.7454E-4 |
| 0.0031750 | 2.7675E-4 |
| 0.0031798 | 2.7901E-4 |
| 0.0031838 | 2.8090E-4 |
| 0.0031884 | 2.8318E-4 |
| 0.0031920 | 2.8494E-4 |
| 0.0031970 | 2.8742E-4 |
| 0.0032034 | 2.9063E-4 |
| 0.0032062 | 2.9199E-4 |
| 0.0032149 | 2.9629E-4 |
| 0.0032154 | 2.9652E-4 |
| 0.0032173 | 2.9744E-4 |
| 0.0032246 | 3.0093E-4 |
| 0.0032265 | 3.0180E-4 |
| 0.0032326 | 3.0451E-4 |
| 0.0032376 | 3.0680E-4 |
| 0.0032407 | 3.0824E-4 |
| 0.0032483 | 3.1162E-4 |
| 0.0032489 | 3.1190E-4 |
| 0.0032509 | 3.1274E-4 |
| 0.0032572 | 3.1546E-4 |
| 0.0032592 | 3.1632E-4 |
| 0.0032652 | 3.1888E-4 |
| 0.0032699 | 3.2084E-4 |
| 0.0032733 | 3.2223E-4 |
| 0.0032808 | 3.2528E-4 |
| 0.0032814 | 3.2553E-4 |
| 0.0032830 | 3.2613E-4 |
| 0.0032895 | 3.2865E-4 |
| 0.0032919 | 3.2956E-4 |
| 0.0032982 | 3.3202E-4 |
| 0.0033029 | 3.3376E-4 |
| 0.0033069 | 3.3525E-4 |
| 0.0033142 | 3.3785E-4 |
| 0.0033155 | 3.3833E-4 |
| 0.0033196 | 3.3969E-4 |
| 0.0033241 | 3.4123E-4 |
| 0.0033255 | 3.4167E-4 |
| 0.0033332 | 3.4412E-4 |
| 0.0033360 | 3.4496E-4 |
| 0.0033425 | 3.4690E-4 |
| 0.0033467 | 3.4811E-4 |
| 0.0033518 | 3.4951E-4 |
| 0.0033577 | 3.5111E-4 |
| 0.0033610 | 3.5196E-4 |
| 0.0033679 | 3.5359E-4 |
| 0.0033696 | 3.5402E-4 |
| 0.0033777 | 3.5586E-4 |
| 0.0033790 | 3.5615E-4 |
| 0.0033878 | 3.5798E-4 |
| 0.0033884 | 3.5810E-4 |
| 0.0033943 | 3.5924E-4 |
| 0.0033977 | 3.5988E-4 |
| 0.0033980 | 3.5993E-4 |
| 0.0034063 | 3.6129E-4 |
| 0.0034074 | 3.6148E-4 |
| 0.0034154 | 3.6271E-4 |
| 0.0034167 | 3.6289E-4 |
| 0.0034245 | 3.6397E-4 |
| 0.0034261 | 3.6416E-4 |
| 0.0034336 | 3.6507E-4 |
| 0.0034357 | 3.6528E-4 |
| 0.0034419 | 3.6588E-4 |
| 0.0034455 | 3.6620E-4 |
| 0.0034500 | 3.6661E-4 |
| 0.0034556 | 3.6701E-4 |
| 0.0034577 | 3.6719E-4 |
| 0.0034647 | 3.6760E-4 |
| 0.0034655 | 3.6765E-4 |
| 0.0034658 | 3.6766E-4 |
| 0.0034746 | 3.6803E-4 |
| 0.0034772 | 3.6811E-4 |
| 0.0034838 | 3.6828E-4 |
| 0.0034888 | 3.6836E-4 |
| 0.0034920 | 3.6839E-4 |
| 0.0034989 | 3.6820E-4 |
| 0.0034992 | 3.6820E-4 |
| 0.0034995 | 3.6820E-4 |
| 0.0035064 | 3.6823E-4 |
| 0.0035092 | 3.6816E-4 |
| 0.0035150 | 3.6793E-4 |
| 0.0035207 | 3.6769E-4 |
| 0.0035245 | 3.6746E-4 |
| 0.0035319 | 3.6700E-4 |
| 0.0035340 | 3.6684E-4 |
| 0.0035400 | 3.6635E-4 |
| 0.0035418 | 3.6621E-4 |
| 0.0035423 | 3.6616E-4 |
| 0.0035496 | 3.6546E-4 |
| 0.0035524 | 3.6517E-4 |
| 0.0035578 | 3.6454E-4 |
| 0.0035621 | 3.6404E-4 |
| 0.0035661 | 3.6351E-4 |
| 0.0035716 | 3.6275E-4 |
| 0.0035754 | 3.6219E-4 |
| 0.0035810 | 3.6132E-4 |
| 0.0035847 | 3.6070E-4 |
| 0.0035903 | 3.5974E-4 |
| 0.0035938 | 3.5907E-4 |
| 0.0035994 | 3.5802E-4 |
| 0.0036024 | 3.5740E-4 |
| 0.0036091 | 3.5603E-4 |
| 0.0036119 | 3.5540E-4 |
| 0.0036189 | 3.5383E-4 |
| 0.0036214 | 3.5321E-4 |
| 0.0036285 | 3.5147E-4 |
| 0.0036308 | 3.5088E-4 |
| 0.0036381 | 3.4899E-4 |
| 0.0036393 | 3.4865E-4 |
| 0.0036459 | 3.4680E-4 |
| 0.0036483 | 3.4612E-4 |
| 0.0036487 | 3.4598E-4 |
| 0.0036573 | 3.4338E-4 |
| 0.0036593 | 3.4274E-4 |
| 0.0036663 | 3.4046E-4 |
| 0.0036696 | 3.3935E-4 |
| 0.0036748 | 3.3759E-4 |
| 0.0036799 | 3.3576E-4 |
| 0.0036833 | 3.3448E-4 |
| 0.0036906 | 3.3175E-4 |
| 0.0036918 | 3.3128E-4 |
| 0.0036969 | 3.2929E-4 |
| 0.0037005 | 3.2793E-4 |
| 0.0037013 | 3.2761E-4 |
| 0.0037092 | 3.2439E-4 |
| 0.0037119 | 3.2331E-4 |
| 0.0037173 | 3.2103E-4 |
| 0.0037228 | 3.1866E-4 |
| 0.0037253 | 3.1755E-4 |
| 0.0037331 | 3.1410E-4 |
| 0.0037334 | 3.1397E-4 |
| 0.0037335 | 3.1392E-4 |
| 0.0037414 | 3.1033E-4 |
| 0.0037442 | 3.0908E-4 |
| 0.0037496 | 3.0659E-4 |
| 0.0037551 | 3.0404E-4 |
| 0.0037578 | 3.0272E-4 |
| 0.0037651 | 2.9916E-4 |
| 0.0037657 | 2.9888E-4 |
| 0.0037659 | 2.9878E-4 |
| 0.0037736 | 2.9499E-4 |
| 0.0037768 | 2.9342E-4 |
| 0.0037830 | 2.9030E-4 |
| 0.0037878 | 2.8788E-4 |
| 0.0037923 | 2.8554E-4 |
| 0.0037986 | 2.8229E-4 |
| 0.0038012 | 2.8097E-4 |
| 0.0038067 | 2.7825E-4 |
| 0.0038090 | 2.7710E-4 |
| 0.0038106 | 2.7630E-4 |
| 0.0038168 | 2.7285E-4 |
| 0.0038227 | 2.6984E-4 |
| 0.0038250 | 2.6870E-4 |
| 0.0038273 | 2.6747E-4 |
| 0.0038339 | 2.6411E-4 |
| 0.0038404 | 2.6063E-4 |
| 0.0038427 | 2.5944E-4 |
| 0.0038453 | 2.5816E-4 |
| 0.0038497 | 2.5610E-4 |
| 0.0038520 | 2.5496E-4 |
| 0.0038566 | 2.5281E-4 |
| 0.0038628 | 2.4988E-4 |
| 0.0038636 | 2.4950E-4 |
| 0.0038651 | 2.4880E-4 |
| 0.0038714 | 2.4593E-4 |
| 0.0038773 | 2.4329E-4 |
| 0.0038787 | 2.4267E-4 |
| 0.0038848 | 2.4019E-4 |
| 0.0038860 | 2.3969E-4 |
| 0.0038863 | 2.3956E-4 |
| 0.0038929 | 2.3707E-4 |
| 0.0038952 | 2.3621E-4 |
| 0.0038998 | 2.3459E-4 |
| 0.0039052 | 2.3284E-4 |
| 0.0039081 | 2.3191E-4 |
| 0.0039164 | 2.2946E-4 |
| 0.0039164 | 2.2945E-4 |
| 0.0039164 | 2.2945E-4 |
| 0.0039247 | 2.2733E-4 |
| 0.0039283 | 2.2647E-4 |
| 0.0039329 | 2.2543E-4 |
| 0.0039409 | 2.2388E-4 |
| 0.0039413 | 2.2382E-4 |
| 0.0039420 | 2.2372E-4 |
| 0.0039497 | 2.2253E-4 |
| 0.0039546 | 2.2183E-4 |
| 0.0039581 | 2.2143E-4 |
| 0.0039625 | 2.2113E-4 |
| 0.0039664 | 2.2079E-4 |
| 0.0039695 | 2.2056E-4 |
| 0.0039748 | 2.2015E-4 |
| 0.0039809 | 2.2001E-4 |
| 0.0039832 | 2.1996E-4 |
| 0.0039853 | 2.1994E-4 |
| 0.0039916 | 2.2000E-4 |
| 0.0039977 | 2.2014E-4 |
| 0.0040000 | 2.2024E-4 |

#+begin_src python :session :results file :exports none :var data=interfacemesh0 data1=interfacemesh data2=interfacemesh4 data3=meshConv
import matplotlib
import numpy as np
import matplotlib.pyplot as plt

matplotlib.use('Agg')
fig=plt.figure(figsize=(4,4))
plt.clf()
matplotlib.rcParams['mathtext.fontset'] = 'stix'
matplotlib.rcParams['font.family'] = 'STIXGeneral'
plt.rc('legend',fontsize=8) # using a size in points
arr = np.array(data,float)
arr1 = np.array(data1,float)
arr2 = np.array(data2,float)
arr3 = np.array(data3,float)
#plot
plt.subplot(2,1,1)
plt.xlabel(r'number of DOFs')
plt.ylabel(r'Normalized quantities')
plt.grid()
plt.plot(arr3[:,0],arr3[:,10],'ko',markerfacecolor='red',lw=0.2,ms=4,label=r'$d_{wc}$')
plt.plot(arr3[:,0],arr3[:,12],'ks',markerfacecolor='blue',lw=0.2,ms=4,label=r'$d_{ow}$')
plt.plot(arr3[:,0],arr3[:,11],'k^',markerfacecolor='green',lw=0.2,ms=4,label=r'$\langle u_o \rangle$')
plt.xscale('log')
plt.text(1.05e4,0.75,r'(a)')
plt.legend(loc='best')
plt.ylim(0.7,1.1)

plt.subplot(2,1,2)
plt.xlabel(r'$x/L$')
plt.ylabel(r'$y/L$')
plt.plot(arr[:,0]/5e-4,arr[:,1]/5e-4,'r--',lw=0.5,label=r'$1.05 \times 10^6$')
plt.plot(arr1[:,0]/5e-4,arr1[:,1]/5e-4,'g-',lw=0.5,label=r'$\mathbf{3.70 \times 10^5}$')
plt.plot(arr2[:,0]/5e-4,arr2[:,1]/5e-4,'b--',lw=0.5,label=r'$3.70 \times 10^4$')
plt.legend(loc='best',title=r'Number of DOFs')
plt.text(6,0.7,r'(b)')

plt.tight_layout()
plt.savefig('DNS_meshConv.pdf')
'DNS_meshConv.pdf'
#+end_src

#+RESULTS:
[[file:DNS_meshConv.pdf]]

